[
    {
        "name":"HTML",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"HTML (Hypertext Markup Language) is the standard markup language for creating web pages. It provides the structure and content of a web page."
    },
    {
        "name":"CSS",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"CSS (Cascading Style Sheets) is a style sheet language used to describe the presentation of a document written in a markup language like HTML. It is used to control the layout, color, font, and other visual aspects of a web page."
    },
    {
        "name":"PHP",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A server-side scripting language for web development and dynamic websites."
    },
    {
        "name":"JavaScript",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A client-side scripting language used for building interactive web pages and web applications."
    },
    {
        "name":"Golang",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A statically typed, compiled programming language designed for simplicity, efficiency, and scalability."
    },
    {
        "name":"Python",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A high-level, interpreted programming language known for its simplicity and readability."
    },
    {
        "name":"Java",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A versatile, object-oriented programming language used for a wide range of applications."
    },
    {
        "name":"Elixir",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"TRUE",
        "description":"A functional, concurrent programming language that runs on the Erlang Virtual Machine."
    },
    {
        "name":"Rust",
        "ring":"assess",
        "quadrant":"languages-and-frameworks",
        "isNew":"TRUE",
        "description":"A systems programming language focused on performance, safety, and concurrency."
    },
    {
        "name":"Laravel",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Laravel is a PHP web application framework that provides an elegant and expressive syntax for building web applications. It follows the Model-View-Controller (MVC) architectural pattern and is known for its ease of use and developer-friendly features."
    },
    {
        "name":"Symfony",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Symfony is a PHP web application framework that also follows the Model-View-Controller (MVC) architectural pattern. It is known for its flexibility, scalability, and extensive set of reusable components."
    },
    {
        "name":"Angular",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Angular is a TypeScript-based web application framework for building single-page applications (SPAs). It provides a comprehensive set of tools and features for building complex, scalable, and maintainable web applications."
    },
    {
        "name":"CodeIgniter",
        "ring":"hold",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"CodeIgniter is a PHP web application framework that encourages rapid development. It follows the Model-View-Controller (MVC) architectural pattern and is known for its simplicity and flexibility."
    },
    {
        "name":"Flask",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Flask is a lightweight, flexible Python web framework for building web applications. It is known for its simplicity, ease of use, and minimal setup requirements."
    },
    {
        "name":"Django",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. It provides a comprehensive set of tools and features for building complex, scalable web applications."
    },
    {
        "name":"Gin",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A high-performance, minimalist Go web framework that focuses on simplicity and speed."
    },
    {
        "name":"Echo",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A high-performance, extensible, minimalist Go web framework."
    },
    {
        "name":"Spring",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A popular application development framework for building Java enterprise applications."
    },
    {
        "name":"Phoenix",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A web framework for Elixir that emphasizes developer productivity and application scalability."
    },
    {
        "name":"Hyper",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A fast, safe and correct low-level HTTP library for Rust."
    },
    {
        "name":"Rocket",
        "ring":"assess",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A web framework for Rust with a focus on ease of use and performance."
    },
    {
        "name":"Vert.x",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Vert.x is a toolkit for building reactive applications on the Java Virtual Machine. It is designed to be lightweight, scalable, and asynchronous, making it well-suited for building high-performance, real-time applications."
    },
    {
        "name":"BackboneJs",
        "ring":"hold",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"BackboneJs is a JavaScript library that provides structure to web applications by providing models, views, and collections. It is known for its simplicity and flexibility, making it a popular choice for building single-page applications (SPAs)."
    },
    {
        "name":"jQuery",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"jQuery is a popular JavaScript library that simplifies HTML document traversal, event handling, and AJAX interactions. It is widely used for building interactive and responsive web pages."
    },
    {
        "name":"Slim",
        "ring":"hold",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Slim is a PHP micro-framework that helps you quickly write simple yet powerful web applications and APIs. It is known for its simplicity, flexibility, and performance."
    },
    {
        "name":"Vue.js",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"Vue.js is an open-source, progressive JavaScript framework for building user interfaces and single-page applications."
    },
    {
        "name":"Langchain",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A framework for building applications with large language models (LLMs)."
    },
    {
        "name":"LlamaIndex",
        "ring":"adopt",
        "quadrant":"languages-and-frameworks",
        "isNew":"FALSE",
        "description":"A framework for building applications that leverage large language models and data structures."
    },
    {
        "name":"Composer",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"A dependency management tool for PHP that allows you to declare the libraries your project depends on and it will manage (install/update) them for you."
    },
    {
        "name":"npm",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"The default package manager for the Node.js JavaScript runtime."
    },
    {
        "name":"Mix",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"The build tool for Elixir projects that handles dependencies, compiling the application, running tests, and more."
    },
    {
        "name":"Maven",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"A build automation tool used primarily for Java projects."
    },
    {
        "name":"Cargo",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Rust's package manager and build system."
    },
    {
        "name":"pip",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"The default package installer for Python. It allows you to install, upgrade, and remove Python packages."
    },
    {
        "name":"Gradle",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"A build automation tool for Java projects that provides dependency management, build automation, and more. It can be used as an alternative to Maven"
    },
    {
        "name":"Ansible",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"A relatively simple infrastructure automation engine that automates application deployment, configuration management, cloud provisioning, and intra-service orchestration."
    },
    {
        "name":"Chef",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"One of the oldest and best-known infrastructure automation tools, it facilitates continuous delivery and configuration management by converting infrastructure to code."
    },
    {
        "name":"MySQL",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"MySQL is a popular open-source relational database management system (RDBMS) that is widely used for web applications, data warehousing, and other enterprise-level applications."
    },
    {
        "name":"MongoDB",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"MongoDB is a popular NoSQL database that stores data in flexible, JSON-like documents. It is known for its scalability, high availability, and ease of use."
    },
    {
        "name":"Cassandra",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Cassandra is a distributed, wide-column store NoSQL database management system that is designed to handle large amounts of data across many servers, providing high availability with no single point of failure."
    },
    {
        "name":"VCS",
        "ring":"hold",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Version Control System (VCS) is a software tool that helps manage changes to source code over time. It allows developers to track, collaborate, and revert changes to their codebase."
    },
    {
        "name":"Git",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Git is a distributed version control system for tracking changes in source code during software development. It is widely used for collaborative software development and is known for its speed, efficiency, and flexibility."
    },
    {
        "name":"Jenkins",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Jenkins is an open-source automation server that helps automate the various stages of the software development lifecycle, such as building, testing, and deploying applications."
    },
    {
        "name":"RabbitMQ",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"RabbitMQ is a message broker software (or message-oriented middleware) that implements the Advanced Message Queuing Protocol (AMQP). It is used for building distributed and scalable applications by providing a reliable way to send and receive messages between different components."
    },
    {
        "name":"Kafka",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Kafka is a distributed streaming platform used for building real-time data pipelines and streaming applications. It is known for its high throughput, low latency, and fault-tolerance, making it a popular choice for handling large-scale data processing tasks."
    },
    {
        "name":"HAProxy",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"HAProxy is a free, open-source load balancer software that provides high availability, load balancing, and proxying for TCP and HTTP-based applications. It is widely used for improving the performance and reliability of web applications and services."
    },
    {
        "name":"Docker",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Docker is an open-source containerization platform that allows developers to package applications into containers. Containers provide a consistent and portable way to run applications, making it easier to deploy and manage software across different environments."
    },
    {
        "name":"Kubernetes",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Kubernetes is an open-source container orchestration platform that automates the deployment, scaling, and management of containerized applications."
    },
    {
        "name":"Elasticsearch",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Elasticsearch is a distributed search and analytics engine that acts as the core of the ELK stack. It excels at managing and analyzing large volumes of data."
    },
    {
        "name":"Logstash",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Logstash is the data processing component of the ELK stack. It specializes in collecting, enriching, and transporting data, making it ready for analysis."
    },
    {
        "name":"Kibana",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Kibana is the user interface of the ELK stack, allowing users to create and manage dashboards and visualizations, turning data into easily understandable formats."
    },
    {
        "name":"Filebeat",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Filebeat is a Beat that collects log files and sends them to Logstash or Elasticsearch for processing and analysis."
    },
    {
        "name":"Metricbeat",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Metricbeat is a Beat that collects system and service metrics and sends them to Logstash or Elasticsearch for processing and analysis."
    },
    {
        "name":"Packetbeat",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Packetbeat is a Beat that collects network traffic data and sends it to Logstash or Elasticsearch for processing and analysis."
    },
    {
        "name":"Tempo",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Tempo is a high-performance, open-source, and easy-to-use distributed tracing system. It is part of the LGTM observability stack and is used for collecting and storing traces."
    },
    {
        "name":"Prometheus",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Prometheus is a powerful open-source monitoring and alerting system. It collects and stores time-series data and provides a flexible query language for analyzing the data."
    },
    {
        "name":"Grafana",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Grafana is a popular open-source data visualization and monitoring platform. It provides a flexible and customizable interface for creating dashboards and visualizations from various data sources, including Prometheus and Loki."
    },
    {
        "name":"Loki",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Loki is a horizontally-scalable, highly-available, multi-tenant log aggregation system inspired by Prometheus. It is part of the LGTM observability stack and is used for collecting and storing logs."
    },
    {
        "name":"Promtail",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Promtail is a log agent that collects logs and pushes them to Loki. It is designed to be highly scalable and efficient, making it a key component of the LGTM observability stack."
    },
    {
        "name":"Pyroscope",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Pyroscope is an open-source continuous profiling platform that helps developers understand the performance characteristics of their applications. It provides detailed insights into CPU and memory usage, as well as other performance metrics."
    },
    {
        "name":"Alertmanager",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Alertmanager is a component of the Prometheus monitoring system that handles alerts sent by client applications or other Prometheus servers. It provides a flexible and powerful way to manage and route alerts, including the ability to group, silence, and inhibit alerts."
    },
    {
        "name":"Vagrant",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Vagrant is a tool for building and managing virtual machine environments in a single workflow. It allows developers to create and configure portable development environments, making it easier to ensure consistency across different systems."
    },
    {
        "name":"HCL",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"HCL is the HashiCorp configuration language, a toolkit for creating structured configuration languages that are both human- and machine-friendly, for use with command-line tools."
    },
    {
        "name":"Packer",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Packer is a tool for creating identical machine images for multiple platforms from a single source configuration."
    },
    {
        "name":"Terraform",
        "ring":"adopt",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Terraform is a tool for building, changing, and versioning infrastructure safely and efficiently. It can be used to provision and manage any cloud, infrastructure, or service."
    },
    {
        "name":"Nomad",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Nomad is a distributed, highly-available, data-center aware scheduler. It can be used to deploy a wide variety of workloads including batch, microservices, and stateful services."
    },
    {
        "name":"Vault",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Vault is a tool for securely managing sensitive data, such as passwords, API keys, and certificates."
    },
    {
        "name":"Consul",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Consul is a service mesh solution that provides a full featured control plane with service discovery, configuration, and segmentation functionality. It is used for building and managing distributed systems, ensuring high availability and reliability."
    },
    {
        "name":"Boundary",
        "ring":"assess",
        "quadrant":"tools",
        "isNew":"FALSE",
        "description":"Boundary is an intelligent proxy that creates granular, identity-based access controls for dynamic infrastructure."
    },
    {
        "name":"GitHub",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"GitHub is a web-based hosting service for version control using Git. It provides a platform for developers to host and collaborate on software projects, manage code repositories, and track changes over time."
    },
    {
        "name":"Bitbucket",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"Bitbucket is a web-based hosting service for version control using Git or Mercurial. It provides a platform for developers to host, collaborate on, and manage their software projects, with features like pull requests, issue tracking, and integrated CI/CD."
    },
    {
        "name":"GitLab",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"GitLab is a web-based platform for version control using Git. It provides a comprehensive set of tools for the entire software development lifecycle, including code repositories, issue tracking, continuous integration and deployment, and more. GitLab can be self-hosted or used as a cloud-based service."
    },
    {
        "name":"Jira",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"Jira is a proprietary project management and issue tracking software developed by Atlassian. It is widely used by software development teams and other organizations to plan, track, and manage their work, including bug tracking, agile project management, and more."
    },
    {
        "name":"OpenAI",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"A suite of AI models and tools developed by OpenAI, including GPT-3, DALL-E, and Whisper."
    },
    {
        "name":"Google Gemini",
        "ring":"assess",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"A framework for building conversational AI applications using large language models."
    },
    {
        "name":"AWS",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"Amazon Web Services (AWS) is a comprehensive, evolving cloud computing platform provided by Amazon that includes a mixture of infrastructure as a service (IaaS), platform as a service (PaaS), and packaged software as a service (SaaS) offerings. AWS provides a suite of cloud computing services that include computing, storage, networking, database, analytics, application services, deployment, management, mobile, developer tools, and tools for the Internet of Things."
    },
    {
        "name":"DigitalOcean",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"DigitalOcean is a cloud computing platform that provides virtual private servers (VPS), also known as Droplets, for developers and businesses. It offers a simple and intuitive interface, along with a range of cloud computing services including compute, storage, networking, and managed databases, making it a popular choice for startups, small and medium-sized businesses, and individual developers."
    },
    {
        "name":"Google Cloud",
        "ring":"adopt",
        "quadrant":"platforms",
        "isNew":"FALSE",
        "description":"Google Cloud Platform (GCP) is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search, Gmail, Google Drive, and YouTube. GCP provides a wide range of services, including computing, storage, networking, big data, machine learning, and management tools, making it a comprehensive cloud platform for enterprises, startups, and developers."
    },
    {
        "name":"NoSQL",
        "ring":"adopt",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"NoSQL is a non-relational database management system that provides a flexible schema and scalability. It is often used for handling large, unstructured datasets and real-time web applications."
    },
    {
        "name":"LAMP",
        "ring":"adopt",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"LAMP is an open-source web server environment that includes Linux, Apache, MySQL, and PHP/Python/Perl. It is a widely-used stack for building and hosting web applications."
    },
    {
        "name":"OOP",
        "ring":"adopt",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"Object-Oriented Programming (OOP) is a programming paradigm based on the concept of objects, which can contain data (properties) and code (methods). OOP is a fundamental approach to software design and development."
    },
    {
        "name":"Continuous Integration",
        "ring":"adopt",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"Continuous Integration (CI) is a software development practice where developers regularly merge their code changes into a central repository, and then automatically build and test the integrated codebase. This helps to detect and fix integration issues early in the development process."
    },
    {
        "name":"Ajax",
        "ring":"adopt",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"Ajax (Asynchronous JavaScript and XML) is a set of web development techniques that use client-side scripting to create asynchronous web applications. It allows web pages to be updated incrementally, without requiring a full page refresh, improving the user experience."
    },
    {
        "name":"WordPress Plugin and Themes Development",
        "ring":"hold",
        "quadrant":"techniques",
        "isNew":"FALSE",
        "description":"WordPress Plugin and Themes Development is the process of creating custom plugins and themes for the WordPress content management system. It allows developers to extend the functionality and customize the appearance of WordPress-powered websites."
    }
]
